[{"key": "ChIJgXnPnecEGTkRpiwLFECCbwY", "description": "Our restaurant named as The Residency Hotel, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJSU0zNTUbGTkR9I7NXtblmYs", "description": "Our restaurant named as Galaxy Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJK1_TAHQGGTkRAw8SK1B0uCY", "description": "Our restaurant named as Subway, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJXbGp9XMfGTkRQ6iD5qN32_A", "description": "Our restaurant named as Punjab Frontier Truck Hotel, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJ1VDE0lEEGTkRssiSR5E9DZw", "description": "Our restaurant named as Burger Hub, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJ9TFo150cGTkRFbYCaesRggU", "description": "Our restaurant named as Andaaz Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJNU3MwFYEGTkR_zaQdyEO_3c", "description": "Our restaurant named as Ziafat, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJVQBZJFQbGTkRTRlLGdqLPaI", "description": "Our restaurant named as Salt'n Pepper Faisal Town, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJGdoYd04bGTkRCy53HGNtgIs", "description": "Our restaurant named as Shahi Murgh Chanay, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJS29cpv0FGTkRU2RDEsHu2CI", "description": "Our restaurant named as Dumpukht Kada, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJhYul-J0cGTkR9E14JQA7Y7A", "description": "Our restaurant named as Cooco's Den, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJg3WYpk0EGTkRq3PpAtlGQwY", "description": "Our restaurant named as Bar BQ Tonight, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJJwHvLOMFGTkR4CUQIKNk6AE", "description": "Our restaurant named as Pizza Time, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJhxCeDv0FGTkRUkvSLAZPBUs", "description": "Our restaurant named as Jaidi Pan Shop, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJY5rQ3qUEGTkRW8Kg_f3Aq3U", "description": "Our restaurant named as حاجی نہاری, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJCUVp17YGGTkRJ_eket9p3yA", "description": "Our restaurant named as Al-Farid Hotel, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJocqjE9QDGTkR-qQeFuwIVaI", "description": "Our restaurant named as Ottoman Empire, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJMUzw7_kEGTkRA80GeWneicA", "description": "Our restaurant named as Fri-Chicks, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJCz1WgxwFGTkRNJ76J7x0D2I", "description": "Our restaurant named as Bundu Khan Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJfereo0oEGTkRHXsFNt0CwiU", "description": "Our restaurant named as Pizza Milano, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJDaFf46AcGTkRYtXlxW1q8vE", "description": "Our restaurant named as Haji Sultan Ahmed Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJAQAQnm0GGTkRvnXH9JTsg0o", "description": "Our restaurant named as Peppers Takeoutaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJiZEyz1EEGTkRiU2TcIJrLm4", "description": "Our restaurant named as One Potato Two Potato, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJv8AI0asGGTkR0PjW9IONHFc", "description": "Our restaurant named as Village Pizza, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJK-Ljw1wDGTkRhu6pttu5iu0", "description": "Our restaurant named as Hot-n-Ready Pizza, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJM3SlgFsDGTkRGUqFmX-9lbg", "description": "Our restaurant named as Al-Buraq Fast Food Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJC-NdN77_GDkRBJTaI2bISEc", "description": "Our restaurant named as KFC - Bahria Town Lahore, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJv_jv-73_GDkR1fw7CBFpTmE", "description": "Our restaurant named as Karachi Bar B Q, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJC9GxUXQGGTkRpJfnuyCXorc", "description": "Our restaurant named as Nando's Block Z, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJ4_hp1EkbGTkR3rebS2ftANQ", "description": "Our restaurant named as Carlton Tower Hotel Lahore, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJb6G_gLccGTkRWO_yQDUT8ng", "description": "Our restaurant named as Butt Sweets & Bakers, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJdcEWvu4IGTkRR6uKOK3W5qw", "description": "Our restaurant named as Equidome, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJGXj0yQMGGTkRptA_YlXF5tM", "description": "Our restaurant named as OPTP - DHA T Block, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJ59SyDVcAGTkRdlztvYeyc8U", "description": "Our restaurant named as Ze Grill Valencia, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJ57U2nlgbGTkR91HbCTtJqA8", "description": "Our restaurant named as Waris Nihari, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJtZCgHxUbGTkRYThpkfVKVhg", "description": "Our restaurant named as چاچا مچھی کارنر Chacha Fish Corner, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.7 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJhwVzj1EEGTkR8JPl-xBzb_8", "description": "Our restaurant named as Esketchers, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJI2EOF14FGTkR9XO02IB_vr4", "description": "Our restaurant named as Yasir Broast, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJi9sJQ1sDGTkRb6hY33Jcsx8", "description": "Our restaurant named as Chalupa Mexican Cafe, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJLW55yDACGTkRd7yZTQ7EPTs", "description": "Our restaurant named as Kings & Queens Pizza, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJG3y2W8EEGTkR4ro3spITvj4", "description": "Our restaurant named as South Asia Partnership, run by award winning owners, in the beautiful and attractive view of Lahore. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJ1yoPZ2wBGTkRQjxNMD3Z6rg", "description": "Our restaurant named as BFC, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJvyrz3VQBGTkRYstj_QpMlUY", "description": "Our restaurant named as Yasir Broast, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJhSYZQUUBGTkRNbMHkLRGl_4", "description": "Our restaurant named as Society Office, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.3 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJjfiv0HYBGTkRciFD43Gj5tI", "description": "Our restaurant named as Yasir Broast, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJK_o39RgCGTkR-nePFBvy4RY", "description": "Our restaurant named as Lahore Broast, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.6 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJsX7IjqMEGTkRWyPeb8buTqc", "description": "Our restaurant named as Wholesale Chicken supplier all over in pakistan, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.8 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJh1VVwT0EGTkRTQ5t_mpNLAk", "description": "Our restaurant named as NS KITCHEN EQUIP, run by award winning owners, in the beautiful and attractive view of Lahore. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJL8359NIEGTkRvmOTvfrEZAs", "description": "Our restaurant named as Natural Salts Creations - A division of RVW INT'L., run by award winning owners, in the beautiful and attractive view of Lahore. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJ-QW_bjgbGTkRRlUZw0XdiEo", "description": "Our restaurant named as Qari Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.7 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJT-ggW9sgGTkRW51rVLHGRss", "description": "Our restaurant named as Bhatti Tikka Shop, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJM2x-5HIDGTkReaNMzUXZsOk", "description": "Our restaurant named as Fri Chiks, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups."}, {"key": "ChIJqcXRoF8bGTkRCfUHbqbW-aw", "description": "Our restaurant named as Haji Sahib Nihari Walay, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJN3qFiBEEGTkRFaS44H2-veU", "description": "Our restaurant named as Subway, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJxSujbFEBGTkR4HJBLMH2g2c", "description": "Our restaurant named as Chiniot Pakwan, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJdU84ngQFGTkRswz_7wqG90M", "description": "Our restaurant named as Eedon Restaurant, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 3.9 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani."}, {"key": "ChIJuxAr21oEGTkRw-rew9PvZvc", "description": "Our restaurant named as Karachi Golden Bar BQ, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.2 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts."}, {"key": "ChIJO-IXHV4BGTkRAVAYYEc-MCc", "description": "Our restaurant named as Johnny & Jugnu - Johar Town, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.4 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We Provide Chinese food such as chinese rice, chinese noodles and chinese soups. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJkxRnnmABGTkR4e768o5lpIU", "description": "Our restaurant named as M&N's Fast Food & BBQ, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.5 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts.Along with other services we provide Desi Food such as desi karahi, desi chicken tikka masala and biryani. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}, {"key": "ChIJrZPvHF4BGTkRTMSqh4Ppk1o", "description": "Our restaurant named as Ze Grill, run by award winning owners, in the beautiful and attractive view of Lahore.We have global rating of 4.1 out of 5. The building and decore are charming and rustic, with elegant modern touches. Our menu is prepared on daily basis according to the need of market. We have variety of quality stuff which includes Italian pizza, italian lasagna, italian rice and desserts. One of restaurant's speciality is Junk food in which we have a lot of varieities such as pizza, zinger burger and junk shawarma."}]